In [2]:
# Series 연산
from pandas import Series

s1 = Series([10, 15, 20], index=['일','이','삼'])
s2 = Series([2,4,6,8], index=['일','이','삼','사'])

In [3]:
s1 + 5 #원본 변경 안됨.

일    15
이    20
삼    25
dtype: int64

In [4]:
s1

일    10
이    15
삼    20
dtype: int64

In [5]:
s1 + s2 #같은 index끼리 연산

사     NaN
삼    26.0
이    19.0
일    12.0
dtype: float64

In [8]:
s3 = Series([1,2,3],index=['1줄','2줄','3줄'])
s1
s3
s1 + s3

1줄   NaN
2줄   NaN
3줄   NaN
삼    NaN
이    NaN
일    NaN
dtype: float64

In [10]:
# DataFrame 연산

from pandas import DataFrame
import numpy as np

df1 = DataFrame(np.zeros((3,3), dtype='int32'), index=['one','two','three'])
df1

       0  1  2
one    0  0  0
two    0  0  0
three  0  0  0

In [12]:
df2 = df1 + 3
df2

       0  1  2
one    3  3  3
two    3  3  3
three  3  3  3

In [15]:
df3 = df2*2
df3

       0  1  2
one    6  6  6
two    6  6  6
three  6  6  6

In [16]:
df3 = DataFrame(np.ones((4,4), dtype='int32'), index=['one','two','three','four'])
df3

       0  1  2  3
one    1  1  1  1
two    1  1  1  1
three  1  1  1  1
four   1  1  1  1

In [17]:
df2

       0  1  2
one    3  3  3
two    3  3  3
three  3  3  3

In [18]:
df2 + df3

         0    1    2   3
four   NaN  NaN  NaN NaN
one    4.0  4.0  4.0 NaN
three  4.0  4.0  4.0 NaN
two    4.0  4.0  4.0 NaN

In [25]:
df2.add(df3)
df4 = df2.add(df3,fill_value=0) # nan대신 0을 넣어서 계산해준다.
df4

         0    1    2    3
four   1.0  1.0  1.0  1.0
one    4.0  4.0  4.0  1.0
three  4.0  4.0  4.0  1.0
two    4.0  4.0  4.0  1.0

In [31]:
df4.mean()  #열별 평균
'''
0: 행방향 -> 열단위
1 : 열방향 -> 행단위
'''
df4.mean(axis=1) #행별 평균

four     1.00
one      3.25
three    3.25
two      3.25
dtype: float64

문자열이 있는 데이타프레임의 연산

In [32]:
mydata = {
          'name':['홍길동','박길동','김길동'], 
          'age':[22,33,44], 
          'dept':['컴공','국어','산업']
         }

In [34]:
df =

TypeError: unsupported operand type(s) for +: 'dict' and 'int'